{"1":
{
    "id" : "1",
    "title": "Cerebral Puzzles",
    "category": "Mobile Game Development",
    "description": "Cerebral Puzzles is a mobile gaming suite that combines the engaging logic challenges of 'FlowFree' and the strategic depths of 'Pull The Pin' into a compelling puzzle experience. In 'FlowFree', players encounter a constantly refreshing array of puzzles with a dynamic level generation algorithm, user-friendly interface, and vibrant graphics suitable for all skill levels. In contrast, 'Pull The Pin' offers a series of progressively complex puzzles that evolve with the player’s abilities, emphasizing strategic gameplay and adaptive challenges. Together, these games make 'Cerebral Puzzles' an ideal destination for those seeking a mentally stimulating and endlessly entertaining puzzle-solving journey.",
    "sitename": "-->Github Repo",
    "deliverables": ["project website"],
    "tools": ["C#", "Unity", "Python"],
    "coverphoto": "/photos/flow.jpeg",
    "img1": "/photos/flow1.jpg",
    "img2": "/photos/flow2.jpg",
    "img3": "/photos/pin3.jpg",
    "recording": "",
    "partial": "poker",
    "url": "https://github.com/melisaozdoyuran2001/Cerebral-Puzzles"
},
"2":
{
    "id" : "2",
    "title": "SimpleSQL",
    "category": "Systems Programming",
    "description":"SimpleSQL is a four-phase project designed to simplify SQL query execution. The project kicks off with a lexical scanner for tokenizing SQL queries, followed by integrated parsing and analyzing modules for syntax and semantic checks. It then executes the validated queries and culminates with a robust suite of unit tests. Developed entirely in C, SimpleSQL offers a comprehensive look into SQL query handling.",
    "sitename": "",
    "deliverables": ["project website"],
    "tools": ["C", "SQL"],
    "coverphoto": "/photos/sqlcover.jpg",
    "img1": "/photos/sql1.jpg",
    "img2": "/photos/sql3.jpg",
    "img3": "/photos/sql2.jpg",
    "recording": "",
    "partial": "compiler"
}, 

"3": 
{
    "id" : "3",
    "title": "PokerPro",
    "category": "Strategy Application",
    "description": "Poker Pro is a user-friendly app designed for both novices and experienced players. It simplifies the poker experience with quick card input methods, either manually or via camera scan. The app offers actionable stats and betting strategies, all grounded in advanced algorithms like probability and equity calculations. Users can revisit their gameplay with the Saved Games feature. The primary goal is to gather feedback, ensuring the app meets user needs while keeping it straightforward and intuitive.    ",
    "sitename": "",
    "deliverables": ["project website"],
    "tools": ["Python" ,"Figma"],
    "coverphoto": "/photos/cover1.jpeg",
    "img1": "/photos/poker1.jpg",
    "img2": "/photos/poker2.jpg",
    "img3": "/photos/poker3.jpg",
    "recording": "",
    "partial": "poker"
}
}